load_testing/tsung_logs/20191120-0000/swapspace.xml
<?xml version="1.0"?><tsung loglevel="notice">

  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="15000"/>
  </clients>

  <servers>
    <server host="galen-test-env.dpincekrr8.us-west-2.elasticbeanstalk.com" port="80" type="tcp"/>
  </servers>


  <load>
    <arrivalphase phase="1" duration="30" unit="second">
      <users arrivalrate="1" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="2" duration="30" unit="second">
      <users arrivalrate="2" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="3" duration="30" unit="second">
      <users arrivalrate="4" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="4" duration="30" unit="second">
      <users arrivalrate="8" unit="second"/>
    </arrivalphase>
  </load>

  <options>
    <option name="global_ack_timeout" value="2000"/>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <session name="http-example" probability="100" type="ts_http">
      <setdynvars sourcetype="random_number" start="1000" end="9999999">
	<var name="random_username"/>
      </setdynvars>
      <request>
	 <dyn_variable name="authenticity_token" xpath="/html/head/meta[@name='csrf-token']/@content"/>
	  <http url="/signup" version="1.1" method="GET">
	  </http>
      </request>
      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->{ok,[Val]}=ts_dynvars:lookup(authenticity_token,DynVars), http_uri:encode(Val) end.">
	<var name="encoded_authenticity_token"/>
      </setdynvars>
      <request subst="true">
	<dyn_variable name="user_id" re="Location: http://.*\.com/users/(\d+)\r"/>
      <http url="/signup" version="1.1" contents="authenticity_token=%%_encoded_authenticity_token%%&amp;user%5Bname%5D=test%%_random_username%%&amp;user%5Bemail%5D=test%%_random_username%%%40gmail.com&amp;user%5Bpassword%5D=fdsafdsa&amp;user%5Bpasswrod_confirmation%5D=fdsafdsa&amp;commit=Create+my+account" method="POST">
      </http>
      </request>
      <thinktime value="2" random="true"/>
      <request subst="true">
	<dyn_variable name="item_id" re="Location: http://.*\.com/items/(\d+)\r"/> 
        <http url="/items" method="POST" version="1.1" contents="authenticity_token=%%_encoded_authenticity_token%%&amp;item%5Bcategory%5D=fruit&amp;item%5Bname%5D=banana&amp;item%5Buser_id%5D=%%_user_id%%&amp;item%5Bimages%5B%5B%5B=&amp;commit=Create+Item"/>
      </request>
      <thinktime value="2" random="true"/>
      <request subst="true">
	<dyn_variable name="first_item" xpath="/html/body/table/tbody/tr[1]/td[6]/a/@href"/> 
	<http url="/items" method="GET" version="1.1"/>
      </request>
      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->                   {ok,Val}=ts_dynvars:lookup(first_item,DynVars),                   L1 = re:replace(Val,&quot;/items/&quot;,&quot;&quot;,[{return,list}]) end. ">
    <var name="new_first_item"/>
      </setdynvars>
      <thinktime value="2" random="true"/>
      <request subst="true">
	<dyn_variable name="item_id" re="Location: http://.*\.com/items/(\d+)\r"/>
        <http url="/items/%%_item_id%%/trade/%%_new_first_item%%" method="POST" contents="authenticity_token=%%_encoded_authenticity_token%%" version="1.1"/>
      </request>
      </session>
  </sessions>
</tsung>